[Helmet_Titan_M X2BodyPartTemplate]
DisplayName="Titan Armor Helmet"

[Helmet_Titan_F X2BodyPartTemplate]
DisplayName="Titan Armor Helmet"

[Helmet_GrandTitan_M X2BodyPartTemplate]
DisplayName="Grand Titan Armor Helmet"

[Helmet_GrandTitan_F X2BodyPartTemplate]
DisplayName="Grand Titan Armor Helmet"

[CX_TitanArmor_Arms_F X2BodyPartTemplate]
DisplayName="Titan Armor Arms"
[CX_TitanArmor_Arms_M X2BodyPartTemplate]
DisplayName="Titan Armor Arms"

[CX_TitanArmor_Arms2_F X2BodyPartTemplate]
DisplayName="Titan Armor Arms 2"
[CX_TitanArmor_Arms2_M X2BodyPartTemplate]
DisplayName="Titan Armor Arms 2"

[CX_TitanArmor_Arms3_F X2BodyPartTemplate]
DisplayName="Titan Armor Arms 3"
[CX_TitanArmor_Arms3_M X2BodyPartTemplate]
DisplayName="Titan Armor Arms 3"

[CX_GrandTitanArmor_Arms_F X2BodyPartTemplate]
DisplayName=" Grand Titan Armor Arms"
[CX_GrandTitanArmor_Arms_M X2BodyPartTemplate]
DisplayName=" Grand Titan Armor Arms"

[CX_GrandTitanArmor_Arms2_F X2BodyPartTemplate]
DisplayName="Grand Titan Armor Arms 2"
[CX_GrandTitanArmor_Arms2_M X2BodyPartTemplate]
DisplayName="Grand Titan Armor Arms 2"

[CX_GrandTitanArmor_Arms3_F X2BodyPartTemplate]
DisplayName="Grand Titan Armor Arms 3"
[CX_GrandTitanArmor_Arms3_M X2BodyPartTemplate]
DisplayName=" Grand Titan Armor Arms 3"

[TitanArmor X2ArmorTemplate]
FriendlyName="Titan Armor"
BriefSummary="The Titan Armor is a Heavy weight Assault Powered armor. This Armor should keep our solders safe from fire and any form of poison. The Titan Armor offers substantial HP and armor boosts for its wearer."
TacticalText="<Bullet/>The Titan Armor is a Heavy weight Assault Powered armor. This Armor should keep our solders safe from fire and any form of poison. The Titan Armor offers substantial HP and armor boosts for its wearer. 

[GrandTitanArmor X2ArmorTemplate]
FriendlyName="Grand Titan Armor"
BriefSummary="The Grand Titan Armor package is a addon to the Titan Armor. It offers even more protection and can provide high cover for other soldiers."
TacticalText="<Bullet/>The Grand Titan Armor package is a addon to the Titan Armor. It offers even more protection and can provide high cover for other soldiers.

[TitanStrike X2AbilityTemplate]
LocFriendlyName="Titan Strike"
LocFlyOverText="Titan Strike"
LocHelpText="Devistating ground strike ability. 4 turn cooldown."
LocLongDescription="Titan Strike is a devistating ground stike ability in which the strike will send a shockwave though the ground that will deal damage to all targets caught in the area of effect. 4 turn cooldown."
LocPromotionPopupText="<Bullet/>Titan Strike.<br/><Bullet/> 4 turn cooldown.<br/><Bullet/> Uses one action; does not end your turn.<br/>"

[GrandTitanStrike X2AbilityTemplate]
LocFriendlyName="Grand Titan Strike"
LocFlyOverText="Grand Titan Strike"
LocHelpText="Devistating ground strike ability. 3 turn cooldown."
LocLongDescription="Grand Titan Strike is a devistating ground stike ability in which the strike will send a shockwave though the ground that will deal damage to all targets caught in the area of effect. 3 turn cooldown."
LocPromotionPopupText="<Bullet/>Grand Titan Strike.<br/><Bullet/> 3 turn cooldown.<br/><Bullet/> Uses one action; does not end your turn.<br/>"

[AssaultPoweredArmorTech X2TechTemplate]
DisplayName="Assault Powered Armor"
Summary="We should be able to assemble a stronger Assault Powered Armor based off of our understanding of the heavier Alien armor and power it by an Elerium cell. This new Titan Armor should be extremely durable and might have a few new tricks we can throw back at the enemy."
CodeName="Titan"
LongDescription="These new Titan Armors are a major upgrade to most anything we have now. Adding in the technology used in the Alien's heavier Bio Suits, we should be able to protect our soldiers from most any hazards they might run into. L. Shen."


[TitanArmorImmunities X2AbilityTemplate]
LocFriendlyName="Titan Armor Immunities"
LocLongDescription="Immune to all poisons, acid and fire."
LocHelpText="Immune to all poisons, acid and fire."